app/controllers/parking_spaces_controller.rb

INSERT INTO "parking_spaces" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-03-23 19:50:02.647358"], ["updated_at", "2017-03-23 19:50:02.647358"]]
---
  def create
    space = ParkingSpace.new(user_id: current_user.id,cost: params[:cost], latitude: params[:latitude], longitude: params[:longitude], status: true, address: params[:address])
    space.save